# Pandas basics

In [23]:
import pandas as pd

In [24]:
df = pd.read_csv("../../DataScience/datasets/titanic/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Crosstabs

In [25]:
# Compute a simple cross-tabulation of 2 factors.
pd.crosstab(df['Pclass'], df['Survived'], margins=True)

Survived    0    1  All
Pclass
1          80  136  216
2          97   87  184
3         372  119  491
All       549  342  891

In [26]:
# Compute a cross-tabulation of 3 factors.
pd.crosstab([df['Sex'], df['Pclass']], df['Survived'], margins=True)

Survived         0    1  All
Sex    Pclass
female 1         3   91   94
       2         6   70   76
       3        72   72  144
male   1        77   45  122
       2        91   17  108
       3       300   47  347
All            549  342  891

## Binning values into categories with cut function

In [27]:
df_ages = df[['PassengerId','Age']]
df_ages.head(10)

   PassengerId   Age
0            1  22.0
1            2  38.0
2            3  26.0
3            4  35.0
4            5  35.0
5            6   NaN
6            7  54.0
7            8   2.0
8            9  27.0
9           10  14.0

In [34]:
# Define the bin limits
bin_limits = [0, 5, 10, 25, 50, 100]
# Define the corresponding bin names
bin_names = ['Infant', 'Child', 'Teenager', 'Adult', 'Elderly']

# Bin the age column
df_ages['Category'] = pd.cut(df_ages['Age'], bins=bin_limits, labels=bin_names)
df_ages.head(10)

/Users/cedricdecesare/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

   PassengerId   Age  Category
0            1  22.0  Teenager
1            2  38.0     Adult
2            3  26.0     Adult
3            4  35.0     Adult
4            5  35.0     Adult
5            6   NaN       NaN
6            7  54.0   Elderly
7            8   2.0    Infant
8            9  27.0     Adult
9           10  14.0  Teenager